loadtest/artillery/config-get.yaml
config:
  target: 'http://localhost:8080/'
  http:
    pool: 100
  phases:
    - duration: 10
      arrivalRate: 10
  defaults:
    headers:
      Connection: 'keep-alive'
scenarios:
  - flow:
    - get:
        url: "/tmp/filex.txt"
    - put:
        url: "/tmp/filex.txt"
        body: "hello"
    - get:
        url: "/tmp/filex.txt"